{"meta":{"title":"豆  荚","subtitle":null,"description":"我们竟安于大寒 七原色叠合的冰点 听任思想冻结，感情凝固……(杨牧)","author":"Gerrard","url":"http://blog.yp51md.club"},"pages":[{"title":"About me","date":"2019-02-09T12:50:08.000Z","updated":"2019-04-18T06:10:58.599Z","comments":true,"path":"about/index.html","permalink":"http://blog.yp51md.club/about/index.html","excerpt":"","text":"Who am I?主业物理，业余学点东西。一个爱折腾的小白。 What can you get? 一些记录和奇奇怪怪的想法。《力学》题解！想写一些东西给值得的人看。 Social Info&nbsp; github &nbsp; myfzjgnfz@outlook.com Do not go gentle into that good night!——Dylan Thomas"},{"title":"tags","date":"2019-04-14T12:29:43.000Z","updated":"2019-04-14T12:30:55.295Z","comments":true,"path":"tags/index.html","permalink":"http://blog.yp51md.club/tags/index.html","excerpt":"","text":""},{"title":"categories","date":"2019-04-14T12:32:54.000Z","updated":"2019-04-14T12:42:23.951Z","comments":true,"path":"categories/index.html","permalink":"http://blog.yp51md.club/categories/index.html","excerpt":"","text":""}],"posts":[{"title":"Great books","slug":"Great-books","date":"2020-09-19T02:17:58.000Z","updated":"2020-09-19T02:31:25.223Z","comments":true,"path":"2020/09/19/Great-books/","link":"","permalink":"http://blog.yp51md.club/2020/09/19/Great-books/","excerpt":"","text":"首先老先生们的书在市场化的现在逐渐被遗忘，不要忘记，不要忘记！ 物理专业书基本粒子发展简史 杨振宁这不仅是一本介绍20世纪基本粒子发现时的那段伟大的历史，更是一本通俗的科学哲学著作。 通过对基本粒子的介绍，带出了整个物理学家从实验现象，到更基本的物理概念和物理模型，再到用理论指导实验的整个理论与实践发展的过程，文末对整个物理发展的展望更是激动人心~","categories":[{"name":"life","slug":"life","permalink":"http://blog.yp51md.club/categories/life/"}],"tags":[{"name":"reading","slug":"reading","permalink":"http://blog.yp51md.club/tags/reading/"}]},{"title":"RSS","slug":"RSS","date":"2020-05-08T07:50:02.000Z","updated":"2020-05-08T08:06:38.613Z","comments":true,"path":"2020/05/08/RSS/","link":"","permalink":"http://blog.yp51md.club/2020/05/08/RSS/","excerpt":"","text":"RSS列表RSS会再流行吗。。RSS到是挺符合这分裂的互联网尿性的。。。 自己烧制的About NJU南京大学教务处信息频率: Every 5h抓取链接 https://jw.nju.edu.cn/ggtz/list.htmRSS http://rss.yp51md.club/users/1/web_requests/11/jwNJU.json http://rss.yp51md.club/users/1/web_requests/11/jwNJU.xml 南京大学交换处长期交换频率: Every 5h抓取链接 https://stuex.nju.edu.cn/2553/list.htmRSS http://rss.yp51md.club/users/1/web_requests/12/exNJUlong.json http://rss.yp51md.club/users/1/web_requests/12/exNJUlong.xml 南京大学交换处短期交换频率: Every 5h抓取链接 https://stuex.nju.edu.cn/2554/list.htmRSS http://rss.yp51md.club/users/1/web_requests/14/exNJUshort.json http://rss.yp51md.club/users/1/web_requests/14/exNJUshort.xml 码住好懒啊","categories":[],"tags":[]},{"title":"Set proxy for jupyter notebook","slug":"jupyter","date":"2020-01-19T08:28:09.000Z","updated":"2020-01-19T08:32:27.563Z","comments":true,"path":"2020/01/19/jupyter/","link":"","permalink":"http://blog.yp51md.club/2020/01/19/jupyter/","excerpt":"","text":"首先用于记录在服务器上安装jupyter notebook的过程 安装使用anaconda安装 问题由于端口在3333上，为了使用域名，用apache做了一次转发，发现无法链接到kernel","categories":[{"name":"cs","slug":"cs","permalink":"http://blog.yp51md.club/categories/cs/"}],"tags":[{"name":"python jupyter notebook","slug":"python-jupyter-notebook","permalink":"http://blog.yp51md.club/tags/python-jupyter-notebook/"}]},{"title":"learning_manim","slug":"learning-manim","date":"2020-01-16T01:53:49.000Z","updated":"2020-01-16T01:53:49.835Z","comments":true,"path":"2020/01/16/learning-manim/","link":"","permalink":"http://blog.yp51md.club/2020/01/16/learning-manim/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"大天复习","slug":"astronomy","date":"2020-01-16T01:44:27.000Z","updated":"2020-01-16T01:52:13.725Z","comments":true,"path":"2020/01/16/astronomy/","link":"","permalink":"http://blog.yp51md.club/2020/01/16/astronomy/","excerpt":"","text":"大天复习文中所有照片来自南京大学罗新炼老师，引用请注明来源 我觉得我不行了orz CH1人类认识宇宙的过程 二十一世纪天文挑战根本问题 两暗一黑三起源 地月-太阳系-银河系-本星系群-本超星系团 距离单位 天文学的发展我国古代宇宙观 盖天说 天圆地方 天圆地圆？ 浑天说 东汉的天文学家张衡对浑天说有很大贡献，他在《浑天仪注》中指出天是一个圆球，而不是盖天说中的半圆，地球在天之中类似于鸡蛋黄在鸡蛋内部。 宣夜说 今见载于《晋书·天文志》和《隋书·天文志》，设想宇宙是无限的，天体飘浮在虚空之中，互相远离，受“气”的推动而运行，进退不一。此说不认为天有某种形状，没有“天球”的想法。从天文观测的观点出发，宣夜说并不优于浑天说。 西方的宇宙观 柏拉图同心球宇宙模型 地心说、日心说 Kepler行星运动三定律 TIP：至今推算宇宙中存在$10^3$亿个星系尺度 最大的尺度可见宇宙大小137亿年 $\\to$ 137亿光年 、to 137亿光年 ~ ￥10^26 m￥ 视界 最小尺度 普朗克尺度$l_p=\\frac{\\hbar G}{c^3}$ (量纲分析) 天体的量级 质量-尺度对数图 下图上x轴上的截距~ $- (\\lg(\\rho)+30)/3$ TIPS：值得注意的尺度数据 氢原子质量密度 宇宙临界质量密度 地球半径 6370km 地球质量 $6*10^{24}$kg 太阳质量 $2*10^{30}$ 日地距离 1$AU$=$1.510^{11}m$ $\\to$ 1 pc = $\\frac{1 AU}{1’’}=\\frac{1803600}{\\pi}AU$=3.26ly 银河系 $10^{11}$ 恒星 $10^{12}M_{sun}$= $10^5ly$ 全波段、多信使天文`学 CH2辐射的知识电磁辐射波长由长至短可分为 射电、微波、红外、光学、紫外、X射线和$\\gamma$射线 具有不同的大气通过率 黑体辐射Wein’s Displacement Law $$\\lambda_{max}T=0.29(cmK)$$ 通过黑体谱来确定遥远天体的温度 电磁波谱Kirchoff定律 连续谱 - 热、致密固液气 发射线 - 热、稀薄气体 吸收线 - 冷、稀薄气体 $$\\Delta E=\\left( \\frac{1}{i^2} - \\frac{1}{j^2}\\right)*13.6eV$$ 谱线与恒星的化学成分 电磁谱的产生 原子的电子跃迁 分子谱 可以发现有机物的分子辐射 分子转动跃迁 -&gt;射电波段 分子振动跃迁 -&gt; 红外波段 加速运动 粒子在介质中超光速 正反物质湮灭 谱线位移 Doppler shift $$ \\frac{\\Delta \\lambda }{\\lambda_0} = \\frac{V_r}{c}$$ 远离 $\\to$ 红移 引力红移(Gravitational Redshift) 能量 宇宙学红移 宇宙的时空膨胀 谱线致宽(Line Broadening) Doppler致宽辐射源内部原子的无规热运动和辐射源的整体运动(如转动,湍动)造成谱线致宽。 不仅是发射谱线、吸收谱线也有影响 这里有很好的解释 磁场使谱线分裂 恒星的观测距离的测量视差法 (Parallax) 三角视差法角分辨率和基线 周年视差 1秒差距是周年视差为1‘’的恒星的距离 所有恒星的视察小于一个秒差距距离D（parsec）=1‘’/p p为周年视差 TIPS：秒差距的转换$1pc = 3.086*10^{16}cm=3.26ly=206265AU$ ​ 视差法来测定恒星距离所受到的限制 地球大气扰动的影响,使周年视差的精确测量受到限制。用激光发射器修正 地面望远镜的角分辨本领一般不超过0.01″ Hipparcos (High precision parallax collecting satellite)卫星(1989年8月发射) 角分辨率达到0.001″, 测量了约100万颗恒星的距离。（射电干涉） 通常三角测距法只适用于近距离 (≤ 30-500 pc)的恒星。(而我们银河系内1011颗恒星) VLBA技术可使三角测距达10 kpc。 自行（proper motion）恒星的真实运动在垂直速度上的运动 400 m/s relative to earth center (rotation) 30,000 m/s relative to the sun (orbit) 220,000 m/s relative to the galaxy center (orbit) 370,000 m/s relative to the CMB cosmic wallpaper 自行大的一般是近距离恒星 光度和视亮度 光度 L (luminosity):天体在单位时间内辐射的总能量,是恒星的固有量。 亮度 F (brightness):在地球上单位时间、单位面积接收到的天体的辐射量。$$ L = 4πR^2 F $$ //在传播过程没有影响$$F \\propto LR^{-2} $$ 视亮度的大小取决于三个因素: 天体的光度 距离 可知F与距离成反比 要知道光度首先要知道距离 星际物质对辐射的吸收和散射。 标准烛光和角直径标准尺是天文学上近似大小已知的天体，经由测量它们在天空中的视角直径，可以测量出它们与地球的距离。 已知近似亮度的天体 通过反比律求得距离 视星等m 绝对星等M 公式推导 视星等的测量通常在某一波段 温度定性 - 颜色直接判断温度 温度越高，越蓝 定量 - 色指数 在不同波段测到的星等之差 经验公式$$ T=\\frac{7300k}{c+0.60} $$C=B-V星际尘埃对不同波段的吸收程度不同，故距离会有影响 其他方法 星体原子的激发，激发温度电离温度 大小 直接测量 掩日 辐射定理 光谱分类恒星光谱连续谱来自致密的恒星内部、吸收线来自较冷稀薄的大气太阳最亮的是钠线；不是钠，是对应的层级 并不要到这样的温度，统计下有高温的部分 恒星的光谱型O B A F G K M 共7种光谱型Oh be a fine guy kiss me 赫罗图！！原因 统计分析 重要的内禀参数 光度（绝对星等）- 有效温度（光谱型） 能给出恒星演化的信息 特征 主序带-主序星 90% 白矮星9% 左下 红巨星1% 右上 等半径线 可以估计恒星大小 意义恒星一生的演化 恒星统计 $\\to$ 高光度的恒星比较少 红矮星的时间寿命特别长 Yerkes光谱分类恒星的光度分类 等值线宽 提了一下概念 光谱分类+光度分类 $\\to$ 二维分类 确定了在赫罗图上的位置 分光视差法与上述绝对星等求距离过程相反 质量的测量 双星的分类 目视双星 在望远镜里能够分辨 天体测量双星 一个子星较暗、通过较亮子星的运动来确定 分光双星 子星的运动引起多普勒位移 视向速度曲线 食双星 双星相互交食，引起亮度的变化 光变曲线$\\to$ 温度比、轨道倾角（恒星质量）、恒星大小 运行的角度会影响 TIPS: 结果 光度和质量的统计 对于主序星有质光关系 $L=const*M^{\\mu}$ $\\mu\\in(3.5,4.0)$ 质量半径关系 $R$ ~ $M^{0.5-1}$ 质量越大密度越小 星系正常星系 星系的光谱是恒星的叠加 望远镜 人眼视角大于1‘ 才能看见 望远镜性能指标 角分辨本领 聚光能力 正比于面积、有效口径^2 反射和折射望远镜 折射望远镜有镜面形变、色差 大气窗口大气仅在射电和光学部分波段比较透明 射电望远镜 1cm - 1m 全天候 受大气影响小 长波限制了角分辨率 空间望远镜 其他波段的 CH3 恒星 炙热气体组成，自身能发光的球状天体 力学、热学平衡$ \\to$满足压力的梯度分布 当平衡破坏后，行星演化。 重要问题： G2V主序星 能源机制 太阳中微子问题 质量连续性方程，流体静力学方程 恒星不同区域的传能方程 太阳TIPS: 太阳的基本数据 太阳质量 $1.99 *10^{30}kg=332000M_{earth}$ 半径 $6.96*10^5km=109R_{earth}$ 光度 $3.8610^{33}ergs^{-1}$ 太阳的观测物理性质 角直径 32.5 交叉自转 ，不同地方的自转周期不一样 -出现黑子。 冕的温度可能不满足统计定义，自由程 太阳的质量和光度的比=2 临边昏暗效应 化学组成元素丰度 整体结构 太阳大气：太阳风；日冕；过渡区；色球（稀薄，玫瑰红）；光球 内核：对流；辐射；核心区 太阳和恒星的能源聚变要求：高温高密度 原子之间距离 &lt;1fm $10^{-15}$ 克服库伦势能 ~ Mev 若在经典情况下，麦克斯韦分布下，不能提供足够的能量。 量子隧穿 能量下限的估算： 相差德布罗意波长～能量到$k_bT$数量级就可以 最大的平均结合能$Fe^{56}$ 比铁更重的核的形成：慢中子和快中子，不用克服库伦势 其他产能方式 氢燃烧$4H \\to He + 2 e^+ + \\nu_e +\\gamma$ 效率0.7% 每次反应2个中微子 p-p chain $$Be^8$$不存在A=5也没有He升不上去 CNO cycle 6个反应速度不一样，会积累元素 库伦势不一样，需要更大的温度 两种核反应和温度有很大的关系 其他元素的燃烧WC恒星 太阳中微子验证太阳的产能机制 测得理论预测的1/3 实时探测NDE 2002诺贝尔 恒星的内部结构 辐射、传导、对流、中微子传能 主要是辐射和对流传导由于不致密，气体分子少） 辐射传能不透明系数$\\kappa$ = 1g物质的散射截面 数密度$n=(\\cong)^{-1}$ 恒星内部自由程$l&lt;&lt;R_s$ 要经过$\\sqrt{n}$次碰撞 对流传递了物质、能量、动量、角动量绝热过程 - 对流梯度和物态方程有关 如何比较对流区出现条件：温度低、产能率高 低质量主序星（M&lt;1.1-1.3$M_{sun}$） 辐射区+对流包层 能量产生于内核包层 辐射区只传递光，不传递物质 大质量主序星 对流区＋辐射包层 能量产生于核心区 对流核心 极低质量主序星 整体对流 低温 对流传递物质-&gt;不断循环核燃料 -&gt;寿命极长 活动剧烈 - 强磁场 物态 气态、固态、液态、等离子体…… 理想气体的偏离 相对论 部分电离气体 简并气体 辐射压 系综 压强=气体压强+辐射压强 非简并气体 光子气体$$P_{rad}=\\frac{aT^4}{3}$$· 简并气体 高密低温 物理成因：相空间的量子化和Pauli不相容 电子简并压： 费米动量 $p \\propto n^{\\frac{1}{3}}$ 平稳燃烧的实现核反应对温度敏感 两种温度分别对应两种恒星的中央温度 标准太阳模型基本假设 单星近似 无磁场 无旋 牛顿引力理论 静态假设：静力学平衡、热力学平衡 ps. gravity darkening 平衡条件质量连续性方程 流体静力学平衡 Virial 定理 TIPS: $ \\frac{P}{r}=-\\rho\\frac{GM}{r^2}$ 即欧拉公式 引力收缩点燃核反应 点燃失败？褐矮星 质光关系 日震学太阳内部扰动产生的压力波 声波 可以用来研究太阳内部结构 CH4 恒星的演化恒星演化的基本原理云块引力塌缩的条件（Virial定理） 金斯判据 引力大于热运动 金斯质量 塌缩足够小是需要考虑量子力学效应，简并压 质量比较下的时候，质量点不燃恒星 那个图像很重要 恒星演化在中心 白矮星临界质量 逐渐压缩点燃更重的元素 铁核爆发 超新星爆发 Russell Vogt原理初始平衡 $\\to $ 初始质量&amp;化学丰度 $\\to$ 决定了演化和结构 单心假设 不存在物质交换 恒星演化的时标动力学时标自引力下引力塌缩的时标 对于太阳是1600s左右 恒星的震荡模 欧拉方程 -》自由落体时标 -》爆炸时标 静力学平衡时两个时标相等！ 通过时标看什么占主导 热时标辐射掉自己热量的时间 核反应时标假定恒星光度不变 主序时标 但实际上光度和质量的3.5次方有关 恒星的统计和演化 认为相同质量的恒星演化过程相同 恒星的诞生和死亡率相同 H-R 图上的数量表现了停留时间长短 形成 $ \\to $ 主序演化 $ \\to $ 主序后演化 $ \\to $ 致密星超星系爆发 主序后演化低质量恒星的演化（&lt;2.25$M_{sun}$）亚巨星支- 核心H枯竭 - 外部H燃烧包层 以辐射传能为主 红巨星支TIPS：红巨星的内部过程 滚雪球$\\to$He质量不断增大$\\to$点燃He核 质量太小无法点燃$\\to$单星演化时间长，双星系统，，氦白矮星 辐射传能过渡到对流传能 3-$\\alpha$反应 经验公式 光度之和核心质量有关系 光度由H的燃烧壳层有关 He闪当攀升到红巨星的顶点的时候 但是在外面观察不到 水平支质量在0.8–2.0 M☉之间的恒星核心中，其氦核主要是由电子简并压力支撑著，氦融合在氦闪的时间刻度上点燃。在质量较大恒星非简并态的核心中，不会发生氦闪，但氦融合燃烧的速度相对较氦闪为慢。氦闪过程中释放的核能非常大，在几秒钟内释出的能量相当于太阳在几天之内释放出的能量，数量级大约是太阳光度的108倍至1011倍（大致是银河系的光度）。然而，能量会由最初是简并态的核以热膨胀消耗掉，因此从恒星外面观测不到。而由于核心的膨胀，覆盖在上层的氢融合速率降低，总能量的产生减少。于是恒星收缩，它虽然迁移到赫罗图上的水平分支 渐近巨星支AGB STAR碳氧核心慢中子俘获反应的场所 壳层He闪-&gt;只留下碳氧核心 热脉冲 行星状星云和白矮星 行星状星云与行星无关 较高质量恒星的演化 M&gt;2.25$M_{sun} $ 主要区别 内部通过CNO 反应 核心区域主要是对流 点燃时不再是简并的 中等质量的恒星的演化 高质量恒星演化 M&gt;12 $M_{sun} $ 各种元素不断燃烧、越来越快 铁核是反应的终结点 核塌缩和超新星爆发 特大质量的恒星 总结 元素的合成一代代恒星不断积累的结果 双星系统 大陵详谬 CH5 恒星的形成星际介质 星际气体主要由氢组成 空间分布不均 OIII的绿色线 H的超精细结构 研究方式——吸收线 分子谱线 巨分子云 星际尘埃星际消光星际红化对蓝光散射较多 星体形成的因素 温度、旋转、磁场 形成的估算 两种估算 金斯不稳定性判据 暗分子云满足盘据 金斯质量会随着形成逐渐变小（T由于热传递不怎么变，数密度增加） CH6 致密星 白矮星 中子星 黑洞 何时讨论相对论效应$\\frac{v^2}{c^2}$$\\frac{2GM}{Rc^2}$ 对角线？轨道运动 位力定理 白矮星历史天狼星 Adams测量天狼星的引力红移（一石二鸟） 内部物理 简并压和引力抗衡 内部物态 $$P_e \\propto \\rho^{5/3} $$(NR) $$P_e \\propto \\rho^{4/3} $$(UR) 量纲分析&amp;静力学平衡 质量越大半径越小 TIPS: 白矮星质量半径关系 氢原子等密度线，形成原因近似 chandrasekhar临界质量 质量越大半径越小的极限 极端相对论情况下5/3-&gt;4/3 超过临界质量，简并压无法抗拒引力作用（白矮星质量上限）引力增加得比压力快 对于He白矮星 $M_ch = 1.44M_{sun}$ 对于CO白矮星 $M_ch = 1.4M_{sun}$ 最大8个太阳质量 TIPS: 推导没有考虑温度旋转磁场…… 表面温度和年龄？ 超新星爆发主要两类 白矮星（质量超过临界质量，点燃h和He） 大质量恒星（烧到铁核之后） 激变变星白矮星与红矮星半相接白矮星吸积物质 $ \\to $ 自引力 做功$ \\to $发光 新星吸积物质在表面的爆炸性核反应 Ia型超新星爆发伴星为红巨星 吸积的白矮星到达Chandrasekha极限爆燃 非常明亮且光度值稳定，成为标准烛光 光变曲线 光变曲线，Fe的半衰期 历史上的超新星skip 超新星爆发机制核能和引力能的释放 大量中微子skip 1987年超新星爆发 中子星特性 大质量恒星演化的结果 铁核塌缩与超新星爆发形成 约为太阳质量，半径10km 很强的磁场 满足零温估计TIPS: 质量上限估算 结构 游离中子 基本方程 1）质量连续性方程（引力质量 2）广义相对论修正 质量半径关系 同样质量越大半径越小 区分中子星和恒星级黑洞 脉冲星为什么脉冲星是中子星？辐射源大小不是所有中子星都是脉冲星 奇异星Witten无法确定奇异星是否存在 脉冲双星略过 黑洞黑洞历史回顾 引力完全占主导的天体 视超光速 中微子超光速？ 厄否实验？ 球是非欧几何 狭义和广义相对论 一些逼逼 线元的定义 非欧几何 球面几何 高斯曲率 黎曼几何测量宇宙的几何？？ 广义相对论 度规 能动张量 黑洞的分类黑洞无毛定理 只有质量、角动量和电荷 黑洞的结构 奇点 无限红移面 光层 1.5史瓦西半径 光子的束缚轨道 裸奇点 黑洞的探测 双星系统中， 对伴星物质的吸积 普朗克质量的蜜汁推导 康普顿波长 两层半径的黑洞 旋转的黑洞 引力脱液效应 无限红移面和视界 能层 黑洞周围时间的运行 超新星合并和引力波的测量 中山大学-天琴计划 科学院- 太极计划 黑洞热力学 霍金蒸发 黑体辐射温度的量纲分析 提取黑洞能量 TIPS: 铁ka线CH7 星系 分类 哈勃序列 结构 形成和演化 Friedman 宇宙模型 这里有一道题目 CH8 宇宙观牛顿宇宙观奥伯斯佯谬 宇宙学原理推了一下相对论下的多普勒效应宇宙学红移 弗里德曼宇宙学模型宇宙微波背景辐射的观测 背景辐射的各向异性 样卷答案2016-2017 1秒差距是周年视差为1‘’的恒星的距离 有强磁场的快速旋转的中子星 万有引力、开普勒 视差法 分光视差 周光 Ia 超新星 高温连续 暗物质 膨胀 褐矮星","categories":[{"name":"physics","slug":"physics","permalink":"http://blog.yp51md.club/categories/physics/"}],"tags":[{"name":"resources","slug":"resources","permalink":"http://blog.yp51md.club/tags/resources/"},{"name":"physics","slug":"physics","permalink":"http://blog.yp51md.club/tags/physics/"}]},{"title":"diisquare日志","slug":"diisquare日志","date":"2019-07-08T14:39:53.000Z","updated":"2019-09-28T11:21:28.503Z","comments":true,"path":"2019/07/08/diisquare日志/","link":"","permalink":"http://blog.yp51md.club/2019/07/08/diisquare日志/","excerpt":"","text":"首先这是记录diisquare的维护日志。由于本人啥都不会，从头开始，所以写到哪算哪。主要目的是给之后的大佬们留个记录，好踩着我的尸体往前走。同时，也提醒自己不要忘了为什么开始做这件事情。逐渐更新…… 7.8 可以联网了bbt寒假回来开始似乎是学校做了一波升级ip发生了变动，所以服务器不能联网了，于是整个网站计划就一直搁置到现在（无奈），本来四校联谊的时候准备做一波网站升级，顺便吹一波的机会也没有实现。这似乎可以称为diisquare的重生日（希望我不要在此时说大话）。总之这是一个挺重要的新的开始。 工作主要用到的命令是 ifconfig //用于修改ipping //用于测试 (事实上我并不确定我是具体怎么把他做好的),but anyway it works！并不想赘述两个命令的用法，列举一点事实： 网卡叫enp0s25; 之前的学长写了一个连校园网的脚本，因此，你可以看到他的账号和密码（笑），不过之后会换成我的吧。就可以连外网了。 应该是dhcp自动分配的ip 下一步 似乎ftp并不能直接做好（再看 2019.7.8 22:50 网盘建好了 整个建立网盘的过程并没有用去多少的空间，很多的内容还是用了原生的Storage和datatable模板； 我偷了一个懒没有写用户的分权限制度，而是直接删除了注册路由； php的上传上限给我拉的很大 太累了，明天再写了； 加油～ 2019.9.7 00:48 懒鬼事实证明，人就是懒惰的，且会给自己不断找理由的生物。这个九月什么都没干，强烈谴责自己；在所谓招新和托福的借口下，放弃了很多事情，但事实上这两个借口也没有做好。白天越来越短了，你这个弟弟。 Long long way to go（进入贤者模式） 目前想到的项目有二手书城；管理系统；矿院树洞； 必须要做的是学习手册的填写； 在大二一定要把二手书城写好！ 现在想到的步骤： 和耿老师聊一聊 前期调研 着手开始 前端优化：用mix 用户分级 改善网盘 邮件系统 学习开源项目 routes们 开始写 月亮偏西，我们以快速渡河。——杨牧 加油啊！ 2019.9.28 19.21","categories":[],"tags":[{"name":"resources","slug":"resources","permalink":"http://blog.yp51md.club/tags/resources/"},{"name":"php","slug":"php","permalink":"http://blog.yp51md.club/tags/php/"},{"name":"lavarel","slug":"lavarel","permalink":"http://blog.yp51md.club/tags/lavarel/"}]},{"title":"书摘_苏州园林","slug":"书摘-苏州园林","date":"2019-06-23T12:02:28.000Z","updated":"2019-06-23T12:04:36.091Z","comments":true,"path":"2019/06/23/书摘-苏州园林/","link":"","permalink":"http://blog.yp51md.club/2019/06/23/书摘-苏州园林/","excerpt":"","text":"首先为社会实践搜集的材料 资料 苏州古典园林 刘敦桢 江南园林志 童寯 苏园六记纪录片里的一些表述 吴门烟水历史和分类 皇家园林 夫差 寺庙园林 晋唐之间 私家园林 《苏州府志记载》 明代苏州园林271处 拙政园、留园 兴于宋元（宋词的风采）、盛于明清 明代吴门画派 文征明 拙政园 手植紫藤 文化内涵沧浪亭 沧浪歌 苏舜钦网师 撒网的渔翁 隐逸文化市场 隐居在城市里结庐在人境 大隐隐于市 富足优裕、文学艺术和恬淡清调浑然一体的明清风雅诗礼传家强调传统教养的书香门第文化的环境 和吴文化的土壤、苏州人的生活长相厮守 分水裁山人眷恋自然的天性 石苏州园林中石是山的代称太湖石 花石纲 石是山的代称米芾的概括 瘦 挺拔的风骨 漏 通畅的血脉 透 剔透的意态 皱 多变的英姿 堆山叠石是一种艺术创作俯视仰视和平视环秀山庄为第一 水对水的创作称为理水以小见大的思路水底造井：改善水质叠石：层层下降以适应水面涨落 艺圃面积不大的园林给人以开阔的感觉这里的水是太湖三万六千顷裁下的一角；这里的石是太湖七十二峰剪来的一山。 深院幽亭戏曲和园林李渔：园林要和戏曲一样布置得曲径幽深，直路中要有迂回，舒缓中要有起伏。 结构分为住宅和庭院两个方面住宅按轴线排列，依次分为了门厅、正厅、内厅及书房、花园之类，族群式庭院没有一处追求对称和规矩的，命名也没有固定的范本 园林建造手段园林路线之曲更多使人产生了一种幽趣之感，山重水复柳暗花明我们的园林是弯弯曲曲的——贝聿铭先生建造手段：以小见大（芥子纳须弥）、曲径通幽（增加了景深、丰富了层次、幽居的一部分） 游廊 空廊 半廊 复廊 花郎为各种天气中的游览提供便利借景墙面碑帖留白 蕉窗听雨天人合一的境界：叠山、理水、园林建筑和栽花植木四大元素植物的人赋品格荷花首选（碗莲） 翠色倚门窗户 空床 漏窗 点睛之笔 花窗 移步换景：自己的漏窗 宅与园的和谐耦园、网师园 陆文夫花木精神和文人品格的联合：卧石听涛、满衫松色、开门看雨、一片蕉声。","categories":[],"tags":[{"name":"reading","slug":"reading","permalink":"http://blog.yp51md.club/tags/reading/"},{"name":"社会实践，苏州园林","slug":"社会实践，苏州园林","permalink":"http://blog.yp51md.club/tags/社会实践，苏州园林/"}]},{"title":"书摘_关于设计的思考","slug":"书摘-关于设计的思考","date":"2019-06-06T08:29:38.000Z","updated":"2019-06-08T08:41:07.044Z","comments":true,"path":"2019/06/06/书摘-关于设计的思考/","link":"","permalink":"http://blog.yp51md.club/2019/06/06/书摘-关于设计的思考/","excerpt":"","text":"首先关于设计的思考（Thoughts on design）是保罗·兰德的作品。想起看这本书主要是因为想为《剪辑的艺术》凑单（逃），只不过因为这本书字最少，竟然是我那次买的书里看的最快的一本。由于这本书是黑白印刷的，所以，关于色彩的部分体现的较少，主要的内容是作者对于设计本身的原则性的问题看法，没有很多关于具体实践的方法论。对于我来说，作为一个技术苦力，希望自己能尽量在每件作品中展现自己的想法吧，毕竟在有限的时间了真正做到”设计”是一件相当困难的事情。 开头的小诗美和实用平面设计——那些既满足美学需求、遵从形式法则又符合二维空间的种种严酷限制用符号、无衬线字体与几何图形诉说想法经过抽象、变形、转换然后旋转、扩大、重复、镜像编组之后又重新编组的设计，如果彼此之间没有相关性就不是好设计 平面设计——但凡能使人联想到维特鲁维奥式对称杰伊·汉比奇的动态对称又或是蒙德里安的非对称都是好的完全形态；那些通过直觉或者电脑通过脑中虚构或者从一个坐标系统中被创造出来的设计，如果没有成为一种有力的沟通手段就不是好的设计。 无论什么类型的视觉传达，不管是说明类还是广告宣传类，从广告看板到出生通告都应当被看作是形式和功能的化身：美和实用的结合……每个要素彼此内在相关、与整体和谐统一，这对创意的实现来说至关重要。 先有素材后有设计啊啊啊。（综设哭泣设计师不应该以先入为主的想法作为设计的起点。想法是（或者应该说是）谨慎学习研究和观察的结果，而设计源于这想法。他即兴创作、不断发明、发现新的组合手段。因为提供给他的素材往往是不充分、模糊、无趣或者不合适做视觉演绎的，设计师的任务正是去再创造或者重述问题。也许就需要抛弃和舍弃其他很多素材。 很多时候我是去迎合大家的审美的。(〒︿〒)设计师面临的问题是双重的：一方面要去预料观众的反应，另一方面要满足自己的审美需求。 即使多数人觉得平凡而熟悉的东西看起来早已习以为常，假如我轻易地归因于平均水平的读者而迎合坏品味，便仅仅是在延续平庸，并且拒绝尝试提高读者在最凡常事务中的审美，并最终无缘享受由此带来的愉悦感。 用符号去沟通符号是想法的抽象概念。符号是不已再现为目的的。符号是一种沟通工具。好斗的垂直结构；消极的水平线。 幽默的作用真正的幽默与其说是源于大脑不如说是发自内心；幽默的本质是爱，不是蔑视，不是那种开怀大笑，而是深藏于心的静静的微笑。 试试拼贴画和投影。 视觉双关想象力和图像，努力啊！通常情况下，平庸的想法或是缺乏想像力的呈现，并不是因为主题苍白，而是因为问题没有得到很好的解释。若缺乏充满创意的视觉解决方案，主题有时候会成为替罪羊。这样的情况多在以下情况中产生。 设计师使用平白无奇的图片诠释平凡的想法。 设计师没有很好的融合形式与内容。 设计师不能在给定空间内，用二维空间的平面构成去诠释问题。想象力的暗寓比眼睛看到的能表达更多。用非同寻常的方式 去诠释司空见惯之物。想象力发挥的空间，人们因为暗示而不是直抒胸臆而被触动。 倒是和我的想法差不多（逃几何抽象的形式（作为吸引注意力的装置）有助于主导画面，摄影图像部分则扮演了辅助的角色。 重视读者的参与的价值 （比如让他们积个分广播和广告电视商已经发现了受众参与的价值。密码拼图、密码、趣味题、记忆测试和各种预热工具已被持续且广泛地使用至今。方法：蒙太奇，拼凑和联想。充分调动观众的影响力，让观众参与创作。 重复的力量对于中文来说比较难，可以试试几何图案的重复。 为什么LaTeX比Word好看字体的质感是通过集中的版面和留白处（白色空间）的反差来实现的，产生对比，以增强字体的质感。 你要追求的目标！排布空间和分配字型材料和符号时，设计者能够一定程度上预先决定观众的视觉移动轨迹。 数字数字作为一种表达手段，具有许多与字母相同的性质，还可以表示时间、视觉空间、位置和数量，它可以使印刷品拥有节奏感和即时性。 昨日和今日（和谈美里的看法很像伟大的原创艺术家，会把传统变成他们自己。他们没有回避传统而是，化为己用。","categories":[{"name":"life","slug":"life","permalink":"http://blog.yp51md.club/categories/life/"}],"tags":[{"name":"reading","slug":"reading","permalink":"http://blog.yp51md.club/tags/reading/"},{"name":"关于设计的思考","slug":"关于设计的思考","permalink":"http://blog.yp51md.club/tags/关于设计的思考/"}]},{"title":"一言合集","slug":"一言合集","date":"2019-05-30T07:44:08.000Z","updated":"2019-05-30T07:46:45.485Z","comments":true,"path":"2019/05/30/一言合集/","link":"","permalink":"http://blog.yp51md.club/2019/05/30/一言合集/","excerpt":"","text":"首先记录我在封面里放的诗句。 2019 我们竟安于大寒 七原色叠合的冰点 听任思想冻结，感情凝固……(杨牧)","categories":[{"name":"life","slug":"life","permalink":"http://blog.yp51md.club/categories/life/"}],"tags":[{"name":"reading","slug":"reading","permalink":"http://blog.yp51md.club/tags/reading/"},{"name":"thoughts","slug":"thoughts","permalink":"http://blog.yp51md.club/tags/thoughts/"}]},{"title":"书摘_基本粒子发现简史","slug":"书摘","date":"2019-05-30T07:05:59.000Z","updated":"2019-06-06T08:54:54.514Z","comments":true,"path":"2019/05/30/书摘/","link":"","permalink":"http://blog.yp51md.club/2019/05/30/书摘/","excerpt":"","text":"首先这些文章用于记录一些形形色色书籍中的激动人心的语句。作为和读书笔记的区别，这里应该会很少记一下自己的想法，及时有也是很少的几句话。持续更新。 《基本粒子发现简史》杨振宁 波尔的一句话总结这一情况，我们可以说，涉及物质的一切普通性质的相互联系方面，卢瑟福的原子模型放在我们面前的任务使人们追忆起哲学家的古老的梦想：将对自然规律的解释还原为对纯粹数的考虑。 这是引用波尔的一句话。 原文： Summarizing the situation, we may say that, as regards the co-ordination of all ordinary properties of matter, Rutherford’s model of the atom puts before us a task reminiscent of the old dream of philosophers : to reduce the interpretation of the laws of nature to the consideration of pure numbers.-N.Bohr,J.Chem.Soc.,Feb.,1932,349 量子力学发明之后的我们对于我们这些在事情已经弄清楚、量子力学已经最终建立之后才受教育的人来讲、量子力学问世之前的那些奥秘的问题和大胆探索的精神，同时充满希望和失望的情况，看几乎像是奇迹一样。我们只能以惊讶的心情来揣想，当时的物理学家必须依靠着明显和不能自相一致的推理来到达正确的结论，那是怎样的一种状态。——杨振宁，基本粒子发现简史，9 奥本海默对于上世纪物理爆炸的评价Our understanding of atomic physics, of what we call the quantum theory of atomic systems, had its origins at the turn of the century and its great synthesis and resolutions in the nineteen-twenties. It was a heroic time. It was not the doing of any one man; it involved the collaboration of scores of scientists from many different lands, though from first to last the deeply creative and subtle and critical spirit of Niels Bohr guided, restrained, deepened, and finally transmuted the enterprise. It was a period of patient work in the laboratory, of crucial experiments and daring action, of many false starts and many untenable conjectures. It was a time of earnest correspondence and hurried conferences, of debate, criticism, and brilliant mathematical improvisation.For those who participated, it was a time of creation; there was terror as well as exaltation in their new insight. It will probably not be recorded very completely as history. As history, its re-creation would call for an art as high as the story of Oedipus or the story of Cromwell, yet in a realm of action so remote from our common experience that it is unlikely to be known to any poet or any historian. In other ways, there will be such times again. Most of us are convinced that today, in our present probings in the sub-atomic and sub-nuclear world, we are laying the groundwork for another such time for us and for our sons. The great growth of physics, the vast and increasingly complicated laboratories of the mid-twentieth century, the increasing sophistication of mathematical analysis, have altered many of the conditions of this new period of crisis. We do not think that they will have altered its heroic and creative character.——J. Robert Oppenheimer, Science And The Common Understanding,35-36(美丽而动人的描述——杨振宁) 杨振宁对大型加速器的看法向庞大体积发展的这种必然的趋势是不幸的，因为它阻碍了自由和个人的创造，并使研究工作变得不够亲切、不够生动和不易于掌握。但是它必须作为生活中的现实来接受。让我们通过下面一个认识鼓起勇气来：尽管加速器和探测器（当然还有实验本身）的体积是如此庞大，它们依旧是建立在一直使研究工作具有无比刺激和启发的那样同样简单、同样亲切和可以掌握的观念上的。——杨振宁，基本粒子发现简史，40 人不中二……在一片庆祝爱因斯坦七十诞辰的文章中，飞利浦·弗兰克（Philipp Frank）提到有一天它曾会向爱因斯坦谈及一位物理学家。因为坚持去解决一些非常困难的问题，这位物理学家在研究工作中的成就很小。他应用了深入的分析，而结果只是发现了愈来愈多的困难，因而他的大多数同事对他的评价都不高。按照法兰克所讲，当时爱因斯坦曾说：“我尊敬这样的人，我不能容忍这样一种科学家，他拿起一块木板来，寻找最薄的地方，然后在容易钻孔的地方钻很多空。”——《基本粒子发现简史》，41 爱因斯坦对物理学的看法物理学的目标： 构成理论物理学的完整体系是概念、被认为对这些概念是确立的基本定律以及经过逻辑推理而获得的结论。也就对大型加速器的看法《是这样一些结论必须与我们各种不相关的结论相符合。这一体系的结构属于推理的工作；其中属于经验的各个部分和它们互相之间的关系必须在理论的结论中表示出来。整个体系，特别是作为他的基础的那些概念和基本原理所独有的价值和根据，就在于这种表示的可能性。这些不能通过逻辑过程进一步还原的基本概念和假设组成了理论的实质部分，它们是推理所接触不到的。一切理论的崇高目标就在于使这些不能再还原的要素尽可能地简单和少，而不至于排除任何经验内容的适当表现。 关于这个崇高的目标能否实现的问题，他的结论是： ……，我们能否果真希望找到一条正确的道路？不仅如此，这条正确的道路除了作为我们的幻想以外是否还有任何存在的余地呢？我们能否希望由经验来指引我们走向这条正确的道路，如果确有那些在很大程度上对经验能下正确判断但并没有追溯到事物根源到理论（例如经典力学的）的存在？我可以毫不犹豫地回答说，根据我的意见，确实有这样一条正确的道路，而且我们有能力去找到他。迄今为止，我们的经验已经证实了我们有理由相信，自然是可以想象得到的最简单的数学观念的具体表现。我坚信我们能够通过纯粹的数学推理的方法来发现概念和那些把它们彼此结合在一起的规律，它们是我们理解的自然现象的关键。——A.Einstein, Essays in Science, Philosophical Library, 1934, 14-15爱因斯坦所表达的如此动人的信念，至今仍然鼓舞着和支持着许多物理学家。——杨振宁不想找原话了~(￣▽￣)~*","categories":[{"name":"life","slug":"life","permalink":"http://blog.yp51md.club/categories/life/"}],"tags":[{"name":"reading","slug":"reading","permalink":"http://blog.yp51md.club/tags/reading/"},{"name":"基本粒子发现简史","slug":"基本粒子发现简史","permalink":"http://blog.yp51md.club/tags/基本粒子发现简史/"}]},{"title":"头发的故事01","slug":"头发的故事01","date":"2019-04-18T06:16:01.000Z","updated":"2019-06-08T08:30:18.527Z","comments":true,"path":"2019/04/18/头发的故事01/","link":"","permalink":"http://blog.yp51md.club/2019/04/18/头发的故事01/","excerpt":"","text":"首先自打我想成为（zjg弗兰）面筋哥一样的男人之后，每天早上看到自己鸟窝一样的头发，就有一种想要全推掉的冲动。什么时候我才能有一头自然的柔顺丝滑的长发呢？QAQ 获得一根头发于是，现在我们获得了一根杨氏模量为$Y$的头发（图零）。假设myf的是全世界发质最好的男人，因此他的头发可以视为一根又黑又细的圆柱（图一）。 一小段头发取一小头发，进行分析。这一小段可视为一段圆弧（图二）。认为中心是不伸长的。因此距离圆心$x$的位置收到的应力为$P=Y\\frac{(L+x)\\Delta\\theta -L \\Delta\\theta}{L \\Delta\\theta}=Y\\frac{x}{L}$。 那么对整个面(图三)计算其对于中心轴$ L_0$ 的力矩。 $$ dM=2P \\sqrt { {R^{2} } - { x^{2} } }xdx $$积分：$$ M=\\int_{-R}^{R}2P \\sqrt { {R^{2} } - { x^{2} } }xdx$$$$ M=\\int_{-R}^{R}\\frac{2Y\\sqrt{R^2-x^2}x^2dx}{L}$$结果为:$$ M=Y \\frac{\\pi R^4}{4L} $$$L$是该段圆弧的曲率半径，$R$是头发的半径。至此头发的内部应力计算结束。 头发的形状第一次作死尝试本以为内力都算出来了，剩下的只要分析分析微元，解解微分方程就可以算出头发的形状。然后我就死了。查了一下，如果要算的话大概是这个画风。 你看看这是人算的吗？？ 第二次作死尝试根据参考文献[3]的启发，通过分形的方法数值计算。将长度为$h$的头发，分成$n$段，每一段可视为一段圆弧，也可以视为一段折线。分析第$i$段，在$i$处建系。$y$轴的方向是该段圆弧切线的方向。(图5)折线和y轴的夹角为$\\alpha_i$,这个角就是每一小段头发弯过去的角度。它们的累加为$\\beta$，是头发整体的转角，这是重力和折线的夹角。于是有$$ dmgsin\\beta\\frac{h}{2n}=M=Y \\frac{\\pi R^4}{4L} $$$$ dm=\\rho\\pi R^2\\frac{h}{n}$$计算曲率半径$L$（图6）$$L=\\frac{\\frac{h}{n}}{\\alpha_i}$$联立以上三式，得$$\\alpha_i=\\frac{2\\rho}{YR^2}(\\frac{h}{n})^3sin\\beta$$ 可以算了查得头发的杨氏模量约为$Y=4.39GPa$，直径取$D=0.070mm$, 则半径$R=0.035mm$。取头发的密度$\\rho=10^3kg/m^3$(印象里头发好像能浮在水上)。为什么查不到头发的密度呢？因为大家都在研究的头发的密度是以 $根/cm^2$ 为单位的。（滑稽）$t=\\frac{h}{n}$为一小段头发的长度，其越小越精确。下面是一个简单的c++程序1234567891011121314151617#include&lt;iostream&gt;#include&lt;cmath&gt;#define pi 3.1415926using namespace std;int main()&#123; double x=0,y=0.01; const double c=2*(1000)/(4.39*1e9*(0.000035)*(0.000035)); const double t=0.001; //取1mm为一段 int n=0; while (y&lt;(10.0/180.0*pi)) //弯曲10度 &#123; x=c*t*t*t*sin(y); y+=x; n++; &#125; cout &lt;&lt; n*t &lt;&lt; endl;&#125; 然后又死了尽管现在这个推导看起来很有道理，但实际跑出来的结果确实令人捉急。你甚至要把头发留到$7km$。（白发三千丈，缘愁似个长QAQ）当然可以做一些手脚，比如说少乘一个$t$，或者两个$t$,把杨氏模量改小一点，这样出来的结果都还是挺靠谱的。然并卵。 强行说明不过我们定性的看待那个式子还是能够有所发现。比方说：只要你有耐性，头发一定可以养到地上的。（这不是废话吗）头发越细的人越容易弯。？？？当然头发到末端也会变细的，所以尾端更容易弯。减小杨氏模量也是一个很好的办法。比如说选择潘婷？或者去一次阿玛尼，让您的头发的蛋白质变变结构，我保证这次不会让你尼玛啊。 最后靠重力把头发扳弯，其实是一件挺扯的事。（所以你上面的都在扯淡，小声）。看一下你掉下来的一根头发，这其实它本来就是弯的。：）知乎搜索“头发睡觉后变形，为什么洗过后恢复原型？”，有一些有意思的回答。下一个关于头发的故事，我准备聊聊对于我来说，“你变秃了，也变强了”的强行解释。 参考资料 [1]王敏中, 王敏中. 简支圆管在自重作用下的弯曲[J]. 力学与实践, 1983, 5(6). [2]张钟华. 简支圆管在重力作用下的应力状态[J]. 力学与实践, 1982, 4(1):32-35. [3]张杰, 林彬, 蔡文奇, et al. 弯曲树枝和分形树根的三维模拟[J]. 计算机应用, 2011, 31(06):1703-1705. [4]谢杨莹, 秦玉霞, 杨旭昕, et al. 拉伸法测头发丝杨氏模量实验装置的改装[J]. 物理实验, 2018(9):51-54.","categories":[{"name":"physics","slug":"physics","permalink":"http://blog.yp51md.club/categories/physics/"}],"tags":[{"name":"thoughts","slug":"thoughts","permalink":"http://blog.yp51md.club/tags/thoughts/"}]},{"title":"内容和形式感那一个更重要？","slug":"美的历程读书笔记_1","date":"2019-04-12T12:54:30.000Z","updated":"2019-06-08T07:11:53.198Z","comments":true,"path":"2019/04/12/美的历程读书笔记_1/","link":"","permalink":"http://blog.yp51md.club/2019/04/12/美的历程读书笔记_1/","excerpt":"","text":"首先这是《美的历程》的第一篇读书笔记 我们开始由于我是个手比较笨的人，虽然小时候学过一小段时间的绘画，和较长时间的书法，最后还是因为不得其法而放弃了。入校以来，我在学院综合设计部（综设）做海报、视频，维护自己的blog，学习网页的设计（虽然大部分是在码CSS和JavaScript）也能厚着脸皮说自己是在实践“美”了。这快一年下来，感触还是挺深的。 生活中，我们的审美大多归结为一个问题，这东西好不好看？在我面试综设时问到的最重要的问题就是评价一张海报好不好看，你的修改意见是什么？对于这样问题的回答我们往往回答是字的排布，颜色的选取……这些形式上的，所见即所得的“东西”，是我们判断一件物品是否具有美的几乎全部标准。我们的祖先对于美的感受也源于此： 北京人的石器尚未定型，丁村人的则略有规范，如尖状、球状、橄榄形……等等。到山顶洞人，不但石器已很均匀，归整，而且还有磨制光滑、钻孔、刻纹的骨器和许多所谓的“装饰品”，……，这表明对形体的光滑规整、对色彩的鲜明突出、对事物的同一性（同样大小或同类物件串在一起）……有了最早的朦胧理解、爱好和运用。（李泽厚. 美的历程. 北京：生活·读书·新知三联书店，2008: 2） 这或许是由海报、视频的目的决定的。在它们是好看的之前，首先要的是内容的准确、快速、有效的传递——功能的实现。而能让功能得到最好的传递效果的就是这些形式上的技巧。形式上的技巧是直接作用与我们的感官上的，甚至不需要主动的获取，排布的整体，色彩的绚丽就深深烙在了我们的视网膜上，顺带着你获取了设计者想要传递的信息。 于是，海报的设计很大程度上是取决于排版，而视频的效果在于你的特效是不是炫酷。这样的想法指导下的方法论，就是，我学习了很多的形式感上的准则：对比，重复，对齐，亲密性，幽默感，交互性………并且它们的的确确能给你的作品质的飞跃。 但，即使是先民们最早的朦胧的美的实践也包含了炙热的情感和浓厚的意义啊： 它们（龙飞凤舞的图腾）是原始艺术——审美吗？是，又不是。它们只是山顶洞人撒红粉活动（原始巫术礼仪）的延续、发展和进一步符号图像化。它们只是观念意识物态化活动的符号和标记。但是凝冻在、聚集在这种种图像符号里的社会意识、亦即原始人们那如醉如狂的情感、观念和心理，恰恰使这种图像形式获有了超模拟的内涵和意义，使原始人们对他的感受取得了超感觉的性能和价值，也就是自然形式里沉淀了人的理性性质，并且在客观形象和主管感受两个方面，都如此。这不是别的，正是审美意识和艺术创作的萌芽。（李泽厚. 美的历程. 北京：生活·读书·新知三联书店，2008: 10） 相比之下，我们的工作像是流水线上的罐头，将标准化的食物装进夺人眼球的盒子里。我并不在贬低只注重形式的海报们，他们是非常优秀的，但是总要有点理想，美和实用性应当是相辅相成的，像石窟里的佛陀，不仅有壮观的形态，还有宗教劝诫，哲理的思考；像哥特教堂里的玫瑰窗，不仅有奇幻的光学，还有独特的精神氛围…… 至少这样对于我们的工作流应该发生改变，先入为主的不该是排版，而是该对素材进行观察、思考和演绎，从而带着自己的审美感受去重述问题。 至少应该努力地不让我们的海报停留于引人注目，而是富有想象力的，在表面之外有丰富的信息量的。 至少我们不是在延续平庸，并且拒绝让读者在平凡的事务中找到一些思考，从而使读者的审美被花花绿绿的形式感填满，而忘记思考。 至少在面试的时候问一句：“你从这张海报里看到了什么？” 最后本来是想在大一下这个学期好好写一下美的历程的读书笔记的，然而结果是直接懒狗到了学期末。希望暑假里有心情的话可以补一补书摘和笔记。这本书对于我这种海报民工来说还是非常有帮助的，修炼的是内功心法。动机不纯","categories":[{"name":"life","slug":"life","permalink":"http://blog.yp51md.club/categories/life/"}],"tags":[{"name":"reading","slug":"reading","permalink":"http://blog.yp51md.club/tags/reading/"},{"name":"thoughts","slug":"thoughts","permalink":"http://blog.yp51md.club/tags/thoughts/"},{"name":"美的历程","slug":"美的历程","permalink":"http://blog.yp51md.club/tags/美的历程/"}]},{"title":"程序设计基础的一些知识","slug":"程序设计基础","date":"2019-04-03T06:14:30.000Z","updated":"2019-06-27T09:51:05.992Z","comments":true,"path":"2019/04/03/程序设计基础/","link":"","permalink":"http://blog.yp51md.club/2019/04/03/程序设计基础/","excerpt":"","text":"首先用于记录一些程设课上的细节，以应对考试。 函数全局变量extern全局变量声明1234567int f()&#123; extern int x;&#125;int x=8;int main ()&#123; x++;&#125; //变量声明的作用是对变量进行操作类型的检查，并使可执行代码更加高效 作用域常见的两个错误1. 声明一个未被定义的全局标示符2. 声明了一个存在两个或两个以上定义的全局变量 全局域解析符 ::123456int x;void f()&#123; double x; x++; //double中的x； ::x++; //int中的x；&#125; 文件作用域用static修饰，定义某些东西只能在源文件中使用。1234567//file1.cppstatic int y=1;static void f();//file2.cppextern int y;extern void f(); 编译的时候不会出错，但是链接的时候会报错。 也可以用namespace达到同样的效果。1234namespace &#123; int y; void f();&#125; 变量的生存区123auto int x; // 自动的生存期，auto可忽略static int y; // 静态的生存期register int z; // 建议将空间分配到cpu的寄存器中 函数中定义static仅仅会在第一次调用的时候初始化，并且在函数调用完成之后不会被收回内存空间。1234567891011#include &lt;iostream&gt;using namespace std;int f()&#123; static int y=1; y++; cout &lt;&lt; y &lt;&lt; \" \";&#125;int main ()&#123; f(); f();&#125; 结果为 2 3 用static产生随机数12345unsigned int random()&#123; static unsigned int seed=1; seed =(25173*seed+13849)%65536; return seed;&#125;//25173,13849,65536保证seed不越界 为了解决小函数调用时效率不高的问题123inline int f(int a)&#123; cout &lt;&lt; a;&#125; 通过inline关键词建议编译程序将函数体展开。 带参数的宏1#define swap(x,y) (int temp=a;a=b;b=temp;) 宏定义是字符串替换！a+b*a-b 带有缺省值的函数1void print(int valve, int base=10); 调用12print(10); //base=10;print(10,2);//base=2; 注意：带有缺省值的函数放在最后面。 重载函数有5种匹配原则： 精确匹配 提升匹配 标准转换匹配 自定义转换匹配 匹配失败 复合数据类型联合类型语法与struct一样。1234567891011121314151617181920struct circle &#123; double x,y,r;&#125;enum shape &#123;circle,triangle&#125;struct trianganle &#123; double x1,y1,z1;&#125;union figure&#123; circle circle; triangle triangle;&#125;struct real_figure&#123; figureshape shape; figure figure;&#125;real_figure[MAX];real_figure[index].shape=\"circle\";real_figure[index].figure.circle.x=1;real_figure[index].figure.circle.y=1;real_figure[index].figure.circle.z=1; 指针###指向char的指针123456789int x=1;int *p=&amp;x;cout &lt;&lt; p; //输出p的值(x的地址)cout &lt;&lt; *p; //输出x的值char str[]=\"ABCD\";char *q=&amp;str[0];cout &lt;&lt; q; //输出q指向的字符串：ABCDcout &lt;&lt; *q; //输出q指向的字符：Acout &lt;&lt; (void *)q //输出p的值，即字符串\"ABCD\"的内存首地址 一些写法c++中switch的优势有重复语句时可以节省代码量123456789switch (condition)&#123; case a: A; case b: B; case c: C; break;&#125;a-&gt; A,B,C;b-&gt; B,C;c-&gt; C; for和cin1for(cin&gt;&gt;n;n!='#';cin&gt;&gt;n) 对浮点数进行比较1234double x,y;fabs(x-y)&lt;1e-6;//x==y;fabs(x-y)&lt;1e-6;//x!=y//fab是求浮点绝对值的函数 sqrt12int n;double j=sqrt(float(n)); 用if控制条件编译123456789#define program=1#if program==1//应该编译的内容#endif #if program==2//不会被编译#endif 多平台12345678#ifdef UNIX ...... //适合于UNIX环境的代码#elif WINDOWS ...... //适合于WINDOWS环境的代码#else ...... //适合于其它环境的代码#endif...... //适合于各种环境的公共代码 枚举型12345678910111213141516171819202122232425#include &lt;iostream&gt;using namespace std;enum COLOR&#123;red,green,blue&#125;;ostream&amp; operator &lt;&lt; (ostream&amp; output,enum COLOR &amp; c) //定义运算符“&lt;&lt;”重载函数&#123; switch (c) &#123; case red:output &lt;&lt; \"red\";break; case green:output &lt;&lt; \"green\";break; case blue:output &lt;&lt; \"blue\";break; &#125; return output;&#125;int main()&#123; enum COLOR color=red; //用for循环枚举 for(int i=0;i&lt;=2;i++)&#123; cout &lt;&lt; color; cout &lt;&lt; endl; color=(COLOR)(color+1); &#125; return 0;&#125; 向函数传递二维数组1234int sum(int x[][5],int lin)//需要写入行数和列数&#123; &#125; 将二维数组降维1234int sum(int x[],int lin)&#123;&#125;sum(x[0],lin*row);//因为是二维数组是线性存储的。 strecmp12int strcmp(const char * a,const char *b)x=strcmp(str1,str2);//str1&gt;str2 x&gt;0; = x=0; &lt; x&lt; =; 参考资料 陈家骏、郑滔，《程序设计教程－－用C++语言编程》（第3版），机械工业出版社，2015","categories":[{"name":"cs","slug":"cs","permalink":"http://blog.yp51md.club/categories/cs/"}],"tags":[{"name":"resources","slug":"resources","permalink":"http://blog.yp51md.club/tags/resources/"}]},{"title":"ubuntu18.04安装总结","slug":"ubuntu18-04安装总结","date":"2019-02-22T01:57:18.000Z","updated":"2019-04-14T12:47:17.675Z","comments":true,"path":"2019/02/22/ubuntu18-04安装总结/","link":"","permalink":"http://blog.yp51md.club/2019/02/22/ubuntu18-04安装总结/","excerpt":"","text":"首先由于linux对硬件的支持不够友好，导致出了很多奇奇怪怪的问题。总结一下。方便自己再次重装（大雾） 配置Lenovo-Legion-Y7000cpu: Intel Core™ i5-8300Hgpu: GeForce GTX 1050 安装流程制作U盘启动器官网文档 进入界面后卡死原因是ubuntu对NVIDIA的显卡驱动支持不好，默认启动的F12 从U盘启动 在grub界面按 e 修改quite splash —为quite splash nomodeset通过集显启动。 解决对高通网卡的禁用在shell中输入 sudo modprobe -r ideapad_laptop暂时可以使用无线网卡 分盘策略 盘符 大小 格式 \\ 固态上40G ext4 \\boot 1G ext4 \\swap 2G swap \\home 机械上50G ext4 将启动引导挂在 \\boot上。之后下一步即可。 安装完成之后进入系统和上述操作一样使用独显和启用无线网卡。 更新打开软件更新器(update),换源，更新软件。 无线网卡在shell中： sudo gedit /etc/modprobe.d/ideapad.conf 在打开的文件中输入： blacklist ideapad_laptop 重启后就可以打开WiFi 安装NVIDIA显卡禁用自带的 nouveau nvidia驱动在shell中 sudo gedit /etc/modprobe.d/lacklist-nouveau.conf 添加 blacklist nouveauoptions nouveau modeset=0 更新 sudo update-initramfs -u 后重启 查询显卡型号shell: lspci -vnn | grep VGA 在英伟达官网 查找驱动型号 安装显卡驱动 sudo add-apt-repository ppa:graphics-drivers/ppasudo apt-get updatesudo apt-get install nvidia-** nvidia-*是查找到的型号安装完成后重启。重启后用 nvidia-smi 查看是否安装成功 以上","categories":[{"name":"cs","slug":"cs","permalink":"http://blog.yp51md.club/categories/cs/"}],"tags":[{"name":"ubuntu","slug":"ubuntu","permalink":"http://blog.yp51md.club/tags/ubuntu/"},{"name":"resources","slug":"resources","permalink":"http://blog.yp51md.club/tags/resources/"}]}]}